Tekla.Structures.Drawing.ReinforcementGroup
The ReinforcementGroup class defines a reinforcement group in the drawing.

Tekla.Structures.Drawing.ReinforcementGroup.Attributes
The attributes of the reinforcement.
For more information see Tekla.Structures.Drawing.ReinforcementBase.ReinforcementGroupAttributes.

Tekla.Structures.Drawing.ReinforcementGroup.ReinforcementCustomPosition
Defines the location of the reinforcement bar when using ReinforcementVisibility == ReinforcementVisibilityTypes.Customized.
This location is a value between 0.0 and 1.0 and it defines the proportion from the reinforcement's start point.

Tekla.Structures.Drawing.ReinforcementGroup.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.ReinforcementGroup.#ctor
Create instance of ReinforcementGroup

Tekla.Structures.Drawing.ReinforcementGroup.#ctor(System.Boolean)
Create instance of ReinforcementGroup
SkipLoadingAttributes: If it set to true attributes won't be lodaded.